In [2]:
import pandas as pd

In [3]:
pd.DataFrame({'yes' : [34,32],'No':[232,32]})

   yes   No
0   34  232
1   32   32

In [11]:
pd.DataFrame({'name':["vivek","Golu"],'surname':["choudhary","Goli"]})

    name    surname
0  vivek  choudhary
1   Golu       Goli

In [12]:
pd.DataFrame({'vivek':["good","bad","average"],
              'Goli' :["worst","Good","best"]},
             index=['product A','product B', 'product C'])

             vivek   Goli
product A     good  worst
product B      bad   Good
product C  average   best

In [15]:
pd.Series(["vivek","Himanshu","Rohit","Man","Pranjal","Vijay","Karan"],
          index=[27,15,24,22,18,26,27],name='roll no.')

27       vivek
15    Himanshu
24       Rohit
22         Man
18     Pranjal
26       Vijay
27       Karan
Name: roll no., dtype: object